/**/
"Cancel" = "Storno";
/**/
"Delete" = "Smazat";
/**/
"Open" = "Otevřít";
/**/
"Edit" = "Upravit";
/**/
"Yes" = "Ano";
/**/
"Finish" = "Konec";
/**/
"Done" = "Hotovo";
/**/
"Save" = "Uložit";
/**/
"Undo" = "Zpět";
/**/
"Redo" = "Znovu";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Ano Odstranit";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Použít geometrii";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Smazat geometrii";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Odstranit lomový bod";
/*Geometry Edit Action Name*/
"Insert Part" = "Vložit část";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Vložit lomový bod";
/*Geometry Edit Action Name*/
"Move Vertex" = "Přesunout lomový bod";
/*Geometry Edit Action Name*/
"Remove Part" = "Odebrat část";

/*Collecting attachments*/
"Add" = "Přidat";
/*Collecting attachments*/
"Take Photo or Video" = "Pořídit fotografii či video";
/*Collecting attachments*/
"Choose From Library" = "Vybrat z knihovny";
/*Collecting attachments*/
"Photo" = "Fotografie";
/*Collecting attachments*/
"Video" = "Video";
/*Collecting attachments*/
"Save To Photo Library" = "Uložit do knihovny fotografií";
/*Collecting attachments*/
"Download" = "Stáhnout";

/*Date attribute*/
"Today" = "Dnes";

/**/
"Attachments" = "Přílohy";
"Attributes" = "Atributy";

/**/
"Open in Safari" = "Otevřít v Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Zadejte číslo mezi %i a %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Zadejte číslo mezi %@ a %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Příliš mnoho znaků (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Číslo je mimo povolený rozsah.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Typ pole není podporován";

/**/
"%d of %d" = "%d z %d";

/**/
"Changing Feature Type" = "Změna typu prvku";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Provádíte změnu typu prvku, což může vést k přepsání některých hodnot polí. Určitě chcete operaci provést?";

/**/
"Deleting Feature" = "Odstranění prvku";
"Are you sure you want to delete this feature?" = "Určitě chcete tento prvek odstranit?";

/**/
"Data for pie chart is invalid" = "Data pro výsečový graf nejsou platná";
"No data to create a pie chart" = "K vytvoření výsečového grafu nejsou k dispozici data.";
"No image to display" = "Neexistuje žádný obrázek k zobrazení";

/**/
"Created by %@ seconds ago" = "Vytvořil %@ před několika vteřinami";

/**/
"Created by %@ a minute ago" = "Vytvořil %@ a před minutou";

/**/
"Edited by %@ seconds ago" = "Upravil %@ před několika vteřinami";

/**/
"Edited by %@ a minute ago" = "Upravil %@ před minutou";

/**/
"Created seconds ago" = "Vytvořeno před několika vteřinami";

/**/
"Created a minute ago" = "Vytvořeno před minutou";

/**/
"Edited seconds ago" = "Upraveno před několika vteřinami";

/**/
"Edited a minute ago" = "Upraveno před minutou";

/**/
"Created by %@ %d minutes ago" = "Vytvořil %@ před %d minutami";

/**/
"Created by %@ an hour ago" = "Vytvořil %@ před hodinou";

/**/
"Created by %@ %d hours ago" = "Vytvořil %@ před %d hodinami";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Vytvořil %@ dne %@ v %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Vytvořil %@ dne %@ v %@";

/**/
"Edited by %@ %d minutes ago" = "Upravil %@ před %d minutami";

/**/
"Edited by %@ an hour ago" = "Upravil %@ před hodinou";

/**/
"Edited by %@ %d hours ago" = "Upravil %@ před %d hodinami";

/**/
"Edited by %@ on %@ at %@ - day" = "Upravil %@ dne %@ v %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Upravil %@ dne %@ v %@";

/**/
"Created by %@" = "Vytvořil %@";

/**/
"Edited by %@" = "Upravil %@";

/**/
"Created %d minutes ago" = "Vytvořeno před %d minutami";

/**/
"Created an hour ago" = "Vytvořeno před hodinou";

/**/
"Created %d hours ago" = "Vytvořeno před %d hodinami";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Vytvořeno dne %@ v %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Vytvořeno dne %@ v %@";

/**/
"Edited %d minutes ago" = "Upraveno před %d minutami";

/**/
"Edited an hour ago" = "Upraveno před hodinou";

/**/
"Edited %d hours ago" = "Upraveno před %d hodinami";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Upraveno dne %@ v %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Upraveno dne %@ v %@";

/* Used to denote a required field */
"Required" = "Požadováno";

/* Used for naming layers with no names */
"Layer %d" = "Vrstva %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Nelze najít adresu polohy";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Nelze najít polohu pro adresu";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Nelze přečíst adresu";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Soubor nenalezen";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Nelze nahrát lokátor";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Vnitřní chyba lokátoru";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Lokátor nepodporuje geokódování křižovatek";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Neplatné vlastnosti lokátoru";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Požadované pole chybí";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Lokátor není inicializován";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Nepodporovaný formát lokátoru";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Nepodporovaná transformace projekce";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Nepodporovaný souřadnicový systém";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Zpětné geokódování není u tohoto lokátoru podporováno.";

/* Network analyst errors */
"Cannot open network." = "Nelze otevřít síť.";
"Cannot retrieve route task parameters." = "Nelze získat parametry úkolu trasy.";
"Insufficient number of stops." = "Nedostatečný počet zastávek";
"Stop (%@) was not located." = "Zastávka (%@) nenalezena.";
"Stop (%@) is located on a non traversable element." = "Zastávka (%@) se nachází na nepřístupném prvku.";
"Stop (%@) is located on a soft restricted element." = "Zastávka (%@) se nachází na prvku s mírným omezením.";
"Point barrer (%@) was not located." = "Bodová bariéra (%@) nenalezena.";
"Point barrier (%@) has invalid added cost attribute name." = "Bodová bariéra (%@) má neplatný název atributu přidané ceny.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Čárová bariéra (%@) má neplatný název atributu škálované ceny.";
"Line barrier (%@) does not cover any network elements." = "Čárová bariéra (%@) nepokrývá žádné síťové prvky.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Mnohoúhelníková bariéra (%@) má neplatný název atributu škálované ceny.";
"Polygon barrier (%@) does not cover any network elements." = "Mnohoúhelníková bariéra (%@) nepokrývá žádné síťové prvky.";
"'%@' is an invalid impedance attribute." = "'%@' je neplatný impedanční atribut.";
"'%@' restriction attribute is invalid." = "Restrikční atribut '%@' je neplatný.";
"'%@' accumulate attribute is invalid." = "Akumulační atribut '%@' je neplatný.";
"'%@' is an invalid directions time attribute." = "'%@' je neplatný atribut času trasy.";
"Directions distance attribute is invalid." = "Atribut vzdálenosti trasy je neplatný.";
"Invalid attribute parameter attribute name (%@)." = "Neplatný název atributu v parametru atributu (%@).";
"Invalid attribute parameter parameter name (%@)." = "Neplatný název parametru v parametru atributu (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Neplatný typ hodnoty pro parametr (%2$@) atributu (%1$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neplatná hodnota omezení použití pro parametr (%2$@) atributu (%1$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neutrální hodnota omezení použití pro parametr (%2$@) atributu (%1$@).";
"Soft restricted element (%@) was traversed." = "Mírně omezený prvek (%@) byl překročen.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Síť nemá hierarchický atribut pro provedení hierarchického plánování trasy.";
"No path can be found between a given pair of stops (%@)." = "Mezi daným párem zastávek nelze najít cestu (%@).";
"The input spatial reference is undefined." = "Vstupní souřadnicový systém není definován.";
"The output spatial reference is undefined." = "Výstupní souřadnicový systém není definována.";
"The directions style is invalid." = "Styl trasy je neplatný.";
"The directions language is invalid." = "Jazyk trasy je neplatný.";
"Directions time and distance attributes do not match." = "Atributy času a vzdálenosti trasy se neshodují.";
"The directions road class attribute is invalid." = "Atribut třídy silnice trasy je neplatný.";
"Unknown condition." = "Neznámý stav.";
"Invalid route task parameters." = "Neplatné parametry úkolu trasy.";
"Route task's solution cannot be found." = "Nelze najít řešení úkolu trasy.";
"Route task was cancelled." = "Úkol trasy byl zrušen.";
"Route task internal error." = "Vnitřní chyba úkolu trasy.";
"Route name property is not supported for local route task." = "Vlastnost názvu trasy není podporována pro místní úkol trasy.";
"Local route task parameters should be retrieved from route task." = "Parametry místního úkolu trasy by měly být získány z úkolu trasy.";
"Cannot retrieve network description." = "Nelze získat popis sítě.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Pro hodnoty impedanceAttributeName a accumulateAttributeNames lze určit jen jeden atribut délky.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Pro hodnoty impedanceAttributeName a accumulateAttributeNames lze určit jen jeden atribut času.";
"Service not supported." = "Služba není podporována.";
"Specified start time occurs before January 1, 1970." = "Zadaný počáteční čas se nachází před 1. lednem 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Počáteční čas zastávky (%@) se nachází před 1. lednem 1970";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Zastávka (%@) obsahuje místní časový interval, který začíná dříve než 1. ledna 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Zastávka (%@) obsahuje časový interval UTC, který začíná dříve než 1. ledna 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "Konec časového intervalu zastávky (%@) se nachází před začátkem tohoto časového intervalu.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Neznámé";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centimetry";
"Decimal Degrees" = "Desetinné stupně";
"Decimeters" = "Decimetry";
"Feet" = "Stopy";
"Inches" = "Palce";
"Kilometers" = "Kilometry";
"Meters" = "Metry";
"Miles" = "Míle";
"Millimeters" = "Milimetry";
"Nautical Miles" = "Námořní míle";
"Points" = "Body";
"Yards" = "Yardy";

/* Area Units Abbreviated Strings */
"sq. in" = "čtver. palce";
"sq. ft" = "čtver. stopy";
"sq. yd" = "čtver. yardy";
"ac" = "ac";
"sq. mi" = "čtver. míle";
"sq. mm" = "čtver. mm";
"sq. cm" = "čtver. cm";
"sq. dm" = "čtver. dm";
"sq. m" = "čtver. m";
"ares" = "ary";
"ha" = "ha";
"sq. km" = "čtver. km";

/* Area Units Display Strings */
"Square Inches" = "Čtvereční palce";
"Square Feet" = "Čtvereční stopy";
"Square Yards" = "Čtvereční yardy";
"Acres" = "Akry";
"Square Miles" = "Čtvereční míle";
"Square Millimeters" = "Čtvereční milimetry";
"Square Centimeters" = "Čtvereční centimetry";
"Square Decimeters" = "Čtvereční decimetry";
"Square Meters" = "Čtvereční metry";
"Ares" = "Ary";
"Hectares" = "Hektary";
"Square Kilometers" = "Čtvereční kilometry";

/* Errors */
"Error" = "Chyba";
"Class not @protocol AGSJSONSerializable compliant" = "Třída není kompatibilní s @protocol AGSJSONSerializable";
"Authorization required" = "Je vyžadována autorizace.";
"Token is invalid or has expired" = "Klíč je neplatný nebo vypršel.";
"Unknown error occurred" = "Došlo k neznámé chybě";
"Empty username/password" = "Prázdné uživatelské jméno / heslo";
"Token URL is nil. You must set a valid token URL on the credential." = "Adresa URL klíče je chybná. Je třeba nastavit platnou adresu URL klíče pro přihlašovací údaje.";
"Unknown authentication error" = "Neznámá chyba při ověření";
"Error extracting identity" = "Chyba při extrakci identity";
"Error adding identity to the keychain" = "Chyba při přidávání identity do řetězce";
"Invalid Credentials" = "Neplatné přihlašovací údaje";
"Bad URL." = "Nesprávná adresa URL.";
"The feature layer does not expose an object-id field." = "Vrstva prvku nezobrazuje pole object-id.";
"Both geodatabase and syncParams are required for this method." = "Pro tuto metodu je vyžadována geodatabáze i syncParams.";
"Uploading deltas is not supported with this replica." = "Tato replika neumožňuje nahrávat změny ze synchronizační  delta geodatabáze.";
"Error creating delta geodatabase" = "Chyba při vytváření delta geodatabáze";
"Unable to create result image layer" = "Nelze vytvořit výslednou obrazovou vrstvu";
"Cache at path '%@' not found." = "Mezipaměť nebyla v umístění '%@' nalezena.";
"To add an item, you must be logged in to the portal." = "Chcete-li přidat položku, musíte se přihlásit k portálu.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Chcete-li přidat položku, musíte zadat hodnotu ve funkci AGSPortalItemContentParameters.";
"The portal failed to add the item." = "Portálu se nepodařilo přidat položku.";
"To delete an item, you must be logged in to the portal." = "Chcete-li smazat položku, musíte se přihlásit k portálu.";
"The portal failed to delete the item." = "Portálu se nepodařilo smazat položku.";
"To update an item, an itemId and logged in user are required." = "Chcete-li aktualizovat položku, je třeba se přihlásit a zadat číslo itemID.";
"The item failed to update." = "Položku se nepodařilo aktualizovat.";
"The item failed to update JSON." = "Nepodařilo se aktualizovat JSON pomocí položky.";
"You must be logged in to a portal to add a comment." = "Chcete-li přidat komentář, musíte se přihlásit k portálu.";
"The comment failed to be added." = "Nepodařilo se přidat komentář.";
"You must be logged in to a portal to fetch the current user's rating." = "Chcete-li načíst hodnocení současného uživatele, musíte se přihlásit k portálu.";
"You must be logged in to a portal to add a rating." = "Chcete-li přidat hodnocení, musíte se přihlásit k portálu.";
"The rating failed to be added." = "Hodnocení se nepodařilo přidat.";
"To share an item, you must be logged in to the portal." = "Chcete-li sdílet položku, musíte se přihlásit k portálu.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Chcete-li zrušit sdílení položky, musíte se přihlásit k portálu a určit skupiny, v nichž chcete sdílení zrušit.";
"Bad Request" = "Nesprávný požadavek";
"Credential Required" = "Jsou vyžadovány přihlašovací údaje AGSCredential";
"Job not created" = "Úkol nebyl vytvořen";
"Service did not return a valid URL" = "Služba nenalezla platnou adresu URL";
"Service did not return a file" = "Služba nenalezla soubor";
"Service did not return a size" = "Služba nenalezla velikost";
"Job failed" = "Úkol selhal";
"Job timed out" = "Vypršel čas úkolu";
"Job was cancelled" = "Úkol byl zrušen";
"Job was deleted" = "Úkol byl smazán";
"Feature with objectId: %d not found" = "Prvek s objectId: %d nenalezen";
"No object-id values specified for feature table query." = "Pro dotaz na tabulku prvků nebyly zadány hodnoty object-id.";

/* OAuth */
"The specified clientID is invalid" = "Uvedené číslo clientID je neplatné";

/* Sync */
"Upload is not supported with this service." = "S touto službou není podporováno nahrávání.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Pro spuštění synchronizace musí být specifikován jiný směr synchronizace než AGSGDBSyncDirectionNone.";